EDT/КассовыйСервер/src/InformationRegisters/ксСоединениеДрайвераСККМ/ксСоединениеДрайвераСККМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ксСоединениеДрайвераСККМ</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>СоединениеУстановлено</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ККМ</name>
    <type>
      <types>CatalogRef.ксКассыККМ</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/КассовыйСервер/src/Enums/ксВерсииДраверовATOL/ксВерсииДраверовATOL.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ксВерсииДраверовATOL</name>
  <enumValues>
    <name>Версия_8</name>
  </enumValues>
  <enumValues>
    <name>Версия_10</name>
  </enumValues>
</mdclass:Enum>

EDT/КассовыйСервер/src/CommonModules/ККМ_ФЗ_54СерверПереопределяемый/Module.bsl
Функция ПодключитьсяКККМ(ККМ) Экспорт
	если ПараметрыСеанса.ксВерсияДрайвераATOL.Пустая() Или ПараметрыСеанса.ксВерсияДрайвераATOL = Перечисления.ксВерсииДраверовATOL.Версия_8 Тогда
		Возврат ККМ_ФЗ_54.ПодключитьсяКККМ(ККМ);
	Иначе
		Возврат ККМ_ATOL_10.ПодключитьсяКККМ(ККМ);
	КонецЕсли;	
КонецФункции	


Функция ПечатьЧека(СерверККТ, КассаККМ, ТаблицаТоваров, ПараметрыЧека, ДополнительныеПараметрыЧека,ЭтоВозврат = Ложь, ТипКассовогоЧека) Экспорт
	если ПараметрыСеанса.ксВерсияДрайвераATOL.Пустая() Или ПараметрыСеанса.ксВерсияДрайвераATOL = Перечисления.ксВерсииДраверовATOL.Версия_8 Тогда
		Возврат ККМ_ФЗ_54.ПечатьЧекаФФД_1_05(СерверККТ, КассаККМ, ТаблицаТоваров, ПараметрыЧека, ДополнительныеПараметрыЧека,ЭтоВозврат, ТипКассовогоЧека);
	Иначе
		Возврат ККМ_ATOL_10.ПечатьЧекаФФД_1_05(СерверККТ, КассаККМ, ТаблицаТоваров, ПараметрыЧека, ДополнительныеПараметрыЧека,ЭтоВозврат, ТипКассовогоЧека);
	КонецЕсли;	
КонецФункции	


Функция ПечатьЧекаФФД_1_05(СерверККТ, КассаККМ, ТаблицаТоваров, ПараметрыЧека, ДополнительныеПараметрыЧека,ЭтоВозврат = Ложь, ТипКассовогоЧека) Экспорт
	если ПараметрыСеанса.ксВерсияДрайвераATOL.Пустая() Или ПараметрыСеанса.ксВерсияДрайвераATOL = Перечисления.ксВерсииДраверовATOL.Версия_8 Тогда
		Возврат ККМ_ФЗ_54.ПечатьЧекаФФД_1_05(СерверККТ, КассаККМ, ТаблицаТоваров, ПараметрыЧека, ДополнительныеПараметрыЧека,ЭтоВозврат, ТипКассовогоЧека);
	Иначе
		Возврат ККМ_ATOL_10.ПечатьЧекаФФД_1_05(СерверККТ, КассаККМ, ТаблицаТоваров, ПараметрыЧека, ДополнительныеПараметрыЧека,ЭтоВозврат, ТипКассовогоЧека);
	КонецЕсли;	
КонецФункции	

Функция ПечатьЧекаФФД_1_2(СерверККТ, КассаККМ, ТаблицаТоваров, ПараметрыЧека, ДополнительныеПараметрыЧека,ЭтоВозврат = Ложь, ТипКассовогоЧека) Экспорт
	если ПараметрыСеанса.ксВерсияДрайвераATOL.Пустая() Или ПараметрыСеанса.ксВерсияДрайвераATOL = Перечисления.ксВерсииДраверовATOL.Версия_8 Тогда
		//Возврат ККМ_ФЗ_54.ПечатьЧекаФФД_1_05(СерверККТ, КассаККМ, ТаблицаТоваров, ПараметрыЧека, ДополнительныеПараметрыЧека,ЭтоВозврат, ТипКассовогоЧека);
		Возврат Ложь;
	Иначе
		Возврат ККМ_ATOL_10.ПечатьЧекаФФД_1_2(СерверККТ, КассаККМ, ТаблицаТоваров, ПараметрыЧека, ДополнительныеПараметрыЧека,ЭтоВозврат, ТипКассовогоЧека);
	КонецЕсли;	
КонецФункции	

Процедура ОтключитьсяОтККМ(СерверККМ, ККМ) Экспорт
	если ПараметрыСеанса.ксВерсияДрайвераATOL.Пустая() Или ПараметрыСеанса.ксВерсияДрайвераATOL = Перечисления.ксВерсииДраверовATOL.Версия_8 Тогда
		ККМ_ФЗ_54.ОтключитьсяОтККМ(СерверККМ, ККМ);
	Иначе
		ККМ_ATOL_10.ОтключитьсяОтККМ(СерверККМ, ККМ);
	КонецЕсли;	
КонецПроцедуры	

Процедура ЗаписьЛогаОшибкиККМ(КодОшибки, Описание, ПроизводительККМ, ЧекККМ, ОписаниеОшибкиККМ = "") Экспорт
	если ПараметрыСеанса.ксВерсияДрайвераATOL.Пустая() Или ПараметрыСеанса.ксВерсияДрайвераATOL = Перечисления.ксВерсииДраверовATOL.Версия_8 Тогда
		ККМ_ФЗ_54.ЗаписьЛогаОшибкиККМ(КодОшибки, Описание, ПроизводительККМ, ЧекККМ);
	Иначе
		ККМ_ATOL_10.ЗаписьЛогаОшибкиККМ(КодОшибки, Описание, ПроизводительККМ, ЧекККМ, ОписаниеОшибкиККМ);
	КонецЕсли;	
КонецПроцедуры	

Процедура РегламентСбросСоединенияСККМ() Экспорт
	Зап = Новый Запрос;
	Зап.Текст = "ВЫБРАТЬ
	            |	ксСоединениеДрайвераСККМСрезПоследних.Период КАК Период,
	            |	ксСоединениеДрайвераСККМСрезПоследних.ККМ КАК ККМ
	            |ИЗ
	            |	РегистрСведений.ксСоединениеДрайвераСККМ.СрезПоследних КАК ксСоединениеДрайвераСККМСрезПоследних
	            |ГДЕ
	            |	ксСоединениеДрайвераСККМСрезПоследних.СоединениеУстановлено = ИСТИНА";
				
	Выб = Зап.Выполнить().Выбрать();
	
	ТекВр = ТекущаяДата();
	
	Пока Выб.Следующий() Цикл
		Если ТекВр - Выб.Период >= 300 Тогда
			ККМ_ATOL_10.ЗаписатьФлагСоединенияСККМ(Выб.ККМ, Ложь);
		КонецеСли;
	КонецЦикла;	
КонецПроцедуры	


Функция СнятьZОтчет(ККМ, Кассир) Экспорт
	если ПараметрыСеанса.ксВерсияДрайвераATOL.Пустая() Или ПараметрыСеанса.ксВерсияДрайвераATOL = Перечисления.ксВерсииДраверовATOL.Версия_8 Тогда
		Возврат ККМ_ФЗ_54.СнятьZОтчет(ККМ, Кассир);
	Иначе
		Возврат ККМ_ATOL_10.СнятьZОтчет(ККМ, Кассир);
	КонецЕсли;	
КонецФункции	

Функция СнятьXОтчет(ККМ, Кассир) Экспорт
	если ПараметрыСеанса.ксВерсияДрайвераATOL.Пустая() Или ПараметрыСеанса.ксВерсияДрайвераATOL = Перечисления.ксВерсииДраверовATOL.Версия_8 Тогда
		Возврат ККМ_ФЗ_54.СнятьXОтчет(ККМ);
	Иначе
		Возврат ККМ_ATOL_10.СнятьXОтчет(ККМ);
	КонецЕсли;	
КонецФункции
